
{
  "profile": {
    "name": "NB-SIP-STRUCTURE-1.0",
    "description": "Structural requirements for submissions of SIPs to the National Library of Norway."
  },
  "requirements": [
    {
      "id": "CSIPSTR1",
      "descriptionEnglish": "(https://earkcsip.dilcis.eu/#CSIPSTR1). Any Information Package MUST be included within a single physical root folder (known as the 'Information Package root folder'). For packages contained in an archive format (e.g. ZIP, TAR), the archive MUST unpack to a single root folder, see CSIPSTR3 (https://earkcsip.dilcis.eu/#CSIPSTR3) and NBSIPSTR3.",
      "descriptionNorwegian": "(https://earkcsip.dilcis.eu/#CSIPSTR1). Enhver Informasjonspakke MÅ være inkludert i én enkelt fysisk rotmappe (heretter kjent som 'rotmappa'). Pakker som er pakket i et arkivformat (f.eks. ZIP, TAR), MÅ pakkes ut til én enkelt rotmappe, se CSIPSTR3 (https://earkcsip.dilcis.eu/#CSIPSTR3) og NBSIPSTR3.",
      "requirement": "MUST",
      "cardinality": "1..1",
      "path": "root_folder"
    },
    {
      "id": "NBSIPSTR1",
      "descriptionEnglish": "The Information Package MUST describe exactly one intellectual entity/resource. For more information see Package, representation and data scope(https://digitalpreservation.no/docs/dps/sip/1.0/scope/).",
      "descriptionNorwegian": "En SIP MÅ beskrive nøyaktig én intellektuell entitet/ressurs. Se Pakke-, representasjons- og dataomfang (https://digitalpreservation.no/nb/docs/dps/sip/1.0/scope/) for mer informasjon).",
      "requirement": "MUST"
    },
    {
      "id": "NBSIPSTR2",
      "descriptionEnglish": "The name of the Information Package's root folder MUST be the same as the @OBJID attribute specified in METS.xml file located in the root folder. The name MUST only contain permitted characters, which are: ABCDEFGHIJKLMNOPQRSTUVWXYZ abcdefghijklmnopqrstuvwxyz0123456789-_ . The name of the root folder SHOULD be a unique ID (e.g., a URN). This requirement is a stricter version of CSIPSTR2 (https://earkcsip.dilcis.eu/#CSIPSTR2)",
      "descriptionNorwegian": "Navnet på SIP-ens rotmappe MÅ være det samme som @OBJID-attributten som oppgis på 'METS.xml'-fila i rotmappa. Navnet MÅ kun bruke tillatte tegn, som er: 'ABCDEFGHIJKLMNOPQRSTUVWXYZ abcdefghijklmnopqrstuvwxyz0123456789-_ '. Navnet på rotmappa BØR være en unik ID (f.eks. URN). Dette kravet er en strengere, SIP-spesifikk variant av CSIPSTR2 (https://earkcsip.dilcis.eu/#CSIPSTR2)",
      "requirement": "MUST"
    },
    {
      "id": "NBSIPSTR3",
      "descriptionEnglish": "The Information Package MAY be contained in an archive/compressed form for transfer. If used, only TAR or ZIP formats MUST be used. See also CSIPSTR1 (https://earkcsip.dilcis.eu/#CSIPSTR1). This requirement is a stricter version of CSIPSTR3 (https://earkcsip.dilcis.eu/#CSIPSTR3).",
      "descriptionNorwegian": "En SIP KAN være pakket i et arkivformat eller komprimert format for overføring. Hvis SIP-en er pakket i et format MÅ kun TAR- eller ZIP-format brukes. Se også CSIPSTR1 (https://earkcsip.dilcis.eu/#CSIPSTR1).Dette kravet er en strengere, SIP-spesifikk variant av CSIPSTR3 (https://earkcsip.dilcis.eu/#CSIPSTR3).",
      "requirement": "MAY"
    },
    {
      "id": "NBSIPSTR4",
      "descriptionEnglish": "The Information Package root folder MUST include a file named 'METS.xml'. This file MUST contain metadata that identifies the package, provide a high-level package description, and describe its structure, including pointers to constituent representations. 'METS.xml' MUST meet the requirements specified in the METS.xml requirements (https://digitalpreservation.no/docs/dps/sip/1.0/mets/). This requirement is a stricter version of CSIPSTR4 (https://earkcsip.dilcis.eu/#CSIPSTR4)",
      "descriptionNorwegian": "En SIPs rotmappe MÅ inneholde en fil som heter 'METS.xml'. Fila MÅ inneholde metadata som identifiserer pakka, gir en overordnet beskrivelse av pakka, dens struktur, samt inneholder henvisninger til pakkas representasjoner. 'METS.xml' MÅ innfri kravene spesifisert i Krav til METS.xml (https://digitalpreservation.no/nb/docs/dps/sip/1.0/mets/). Dette er en strengere, SIP-spesifikk variant av CSIPSTR4 (https://earkcsip.dilcis.eu/#CSIPSTR4)",
      "requirement": "MUST",
      "cardinality": "1..1",
      "path": "root_folder/METS.xml"
    },
    {
      "id": "NBSIPSTR5",
      "descriptionEnglish": "The Information Package root folder MUST have a single folder named 'metadata'. Metadata describing the entire information package belongs in this folder. This requirement is a stricter version of CSIPSTR5 (https://earkcsip.dilcis.eu/#CSIPSTR5).",
      "descriptionNorwegian": "En SIPs rotmappe MÅ inneholde nøyaktig én mappe som heter 'metadata'. Her legges metadata som omhandler hele informasjonspakka. Dette kravet er en strengere, SIP-spesifikk variant av CSIPSTR5 (https://earkcsip.dilcis.eu/#CSIPSTR5).",
      "requirement": "MUST",
      "cardinality": "1..1",
      "path": "root_folder/metadata"
    },
    {
      "id": "NBSIPSTR6",
      "descriptionEnglish": "Preservation metadata can be included in the package, but certain types of events are recommended to be submitted via the Submission API. See Events/preservation metadata (https://digitalpreservation.no/docs/dps/api/submission/events/) for more information. If preservation metadata is included in the package, it MUST be placed in a subfolder called 'preservation'. The E-ARK specifications recommend formatting preservation metadata using PREMIS, see E-ARK CSIP-Common Specification for Information Packages (https://earkcsip.dilcis.eu/#useofpremis) and CS PREMIS (https://dilcis.eu/content-types/cits-premis). Preservation metadata refers to events and the processing history of the digital resource. This includes documentation of events such as file migrations to new storage environments, file format conversions, and the validation or verification of files. This requirement is a stricter version of CSIPSTR6 (https://earkcsip.dilcis.eu/#CSIPSTR6). See also the requirements for using METS.xml for metadata in CSIP31-57 (https://earkcsip.dilcis.eu/#useofthemetsadministrativemetadatasectionelementamdsec).",
      "descriptionNorwegian": "Bevaringsmetadata kan legges til i pakken, men enkelte typer eventer anbefales levert via Submission API. Se Eventer/bevaringsmetadata (https://digitalpreservation.no/nb/docs/dps/api/submission/events/) for mer informasjon. Hvis bevaringsmetadata skal legges til i pakken, MÅ disse legges i en undermappe kalt 'preservation'. E-ARK-spesifikasjonene anbefaler å formatere bevaringsmetadata i PREMIS, se E-ARK CSIP - Common Specification for Information Packages (https://earkcsip.dilcis.eu/#useofpremis) og CS PREMIS (https://dilcis.eu/content-types/cits-premis). Med bevaringsmetadata menes hendelser og håndteringshistorikk av den digitale ressursen. For eksempel dokumenteres flytting av filer til nytt lagringssystem, endring av filformat og validering/kontroll av filer. Dette er en strengere, SIP-spesifikk variant av CSIPSTR6 (https://earkcsip.dilcis.eu/#CSIPSTR6). Se også krav for bruk av METS.xml for metadata i CSIP31-57 (https://earkcsip.dilcis.eu/#useofthemetsadministrativemetadatasectionelementamdsec).",
      "requirement": "MUST",
      "cardinality": "0..1",
      "path": "root_folder/metadata/preservation"
    },
    {
      "id": "NBSIPSTR7",
      "descriptionEnglish": "The 'metadata' folder at the root level MUST contain exactly one subfolder named 'descriptive'. Descriptive metadata shall only be placed in this subfolder, and not within the individual representations. Descriptive metadata refers to information that describes the intellectual content of a digital object, such as an identifier, title, creator, and date of publication. This requirement is a stricter version of CSIPSTR7 (https://earkcsip.dilcis.eu/#CSIPSTR7). See also NBSIP4-6 in METS.xml (SIP).(https://digitalpreservation.no/docs/dps/sip/1.0/mets/#:~:text=NBSIP4).",
      "descriptionNorwegian": "Mappa 'metadata' på rot MÅ inneholde nøyaktig én undermappe som heter 'descriptive'. Deskriptive metadata skal kun legges i denne undermappa og ikke på de enkelte representasjonene. Med deskriptive metadata menes informasjon som beskriver det intellektuelle innholdet til et digitalt objekt, for eksempel identifikator, tittel, forfatter og publiseringsdato. Dette er en strengere, SIP-spesifikk variant av CSIPSTR7 (https://earkcsip.dilcis.eu/#CSIPSTR7). Se også NBSIP4-6 i METS.xml (SIP).](https://digitalpreservation.no/nb/docs/dps/sip/1.0/mets/#:~:text=NBSIP4).",
      "requirement": "MUST",
      "cardinality": "1..1",
      "path": "root_folder/metadata/descriptive"
    },
    {
      "id": "NBSIPSTR8",
      "descriptionEnglish": "The descriptive metadata files MUST be formatted as plain text (UTF-8) (e.g., XML, JSON, TXT) and SHOULD follow a well-known metadata standard (e.g., DublinCore, MODS, MARC, EBUCORE, EAD, etc.)",
      "descriptionNorwegian": "De deskriptive metadatafilene i informasjonspakken MÅ være formatert som ren tekst (UTF-8) (f.eks. XML, JSON, TXT) og BØR følge en kjent metadatastandard (f.eks. Dublincore, MODS, MARC, EBUCORE, EAD, etc.)",
      "requirement": "MUST"
    },
    {
      "id": "NBSIPSTR9",
      "descriptionEnglish": "The subfolder 'descriptive' MUST contain one or more files with descriptive metadata. For example, exports of catalog records, information from archival/management systems, and/or other forms of descriptions of the resource. This MAY be in the form of proprietary data from a given system, but SHOULD also be mapped to a well-known standard in accordance with the requirement in NBSIPSTR8.",
      "descriptionNorwegian":"Undermappa 'descriptive' MÅ inneholde én eller flere filer med deskriptive innholdsmetadata. Eksempelvis eksport av katalogposter, informasjon fra arkiv/forvaltningssystemer, og/eller annen form for beskrivelse av ressursen. Dette KAN være i form av proprietære data fra et gitt system, men BØR også mappes til en kjent standard i henhold til krav NBSIPSTR8.",
      "requirement": "MUST",
      "cardinality": "1..n",
      "path": "root_folder/metadata/descriptive/"
    },
    {
      "id": "CSIPSTR8",
      "descriptionEnglish": "(https://earkcsip.dilcis.eu/#CSIPSTR8). If any other metadata are available, they MAY be included in separate sub-folders, for example an additional folder named  'other'.",
      "descriptionNorwegian": "(https://earkcsip.dilcis.eu/#CSIPSTR8). Hvis andre metadata er tilgjengelige KAN disse legges i en mappe som heter 'other'.",
      "requirement": "MAY",
      "cardinality": "0..n",
      "path": "root_folder/metadata/other"
    },
    {
      "id": "NBSIPSTR10",
      "descriptionEnglish": "The Information Package MUST contain exactly one folder named 'representations', see Package, representation and data scope (https://digitalpreservation.no/docs/dps/sip/1.0/scope/) for more information). This requirement is a stricter version of CSIPSTR9 (https://earkcsip.dilcis.eu/#CSIPSTR9).",
      "descriptionNorwegian":"En SIP MÅ inneholde nøyaktig én mappe som heter 'representations', se Pakke-, representasjons- og dataomfang (https://digitalpreservation.no/nb/docs/dps/sip/1.0/scope/) for mer informasjon. Dette er en strengere, SIP-spesifikk variant av CSIPSTR9 (https://earkcsip.dilcis.eu/#CSIPSTR9).",
      "requirement": "MUST",
      "cardinality": "1..1",
      "path": "root_folder/representations"
    },
    {
      "id": "NBSIPSTR11",
      "descriptionEnglish": "The 'representations' folder MUST contain exactly one representation named 'primary_YYYYMMDD' (where primary is followed by the date the folder was created). The contents of this folder constitute the digital object that the package is intended to describe. This is the primary representation in the package, see Package, representation and data scope (https://digitalpreservation.no/docs/dps/sip/1.0/scope/) for more information. This requirement is a stricter version of CSIPSTR10 (https://earkcsip.dilcis.eu/#CSIPSTR10).",
      "descriptionNorwegian":"Mappa 'representations' MÅ inneholde nøyaktig én representasjon som heter 'primary_ÅÅÅÅMMDD' (primary og dato for når mappen ble opprettet). Innholdet i denne mappa er det digitale objektet som pakken skal beskrive. Dette er primærrepresentasjonen i pakken, se Pakke-, representasjons- og dataomfang (https://digitalpreservation.no/nb/docs/dps/sip/1.0/scope/) for mer informasjon. Dette er en strengere, SIP-spesifikk variant av CSIPSTR10 (https://earkcsip.dilcis.eu/#CSIPSTR10).",
      "requirement": "MUST",
      "cardinality": "1..1",
      "path": "root_folder/representations/primary_YYYYMMDD"
    },
    {
      "id": "NBSIPSTR12",
      "descriptionEnglish": "If needed, the 'representations' folder MAY contain multiple representations. Naming of representations should consist of a meaningful name and the date the folder was created (meaningfulname_YYYYMMDD). A meaningful name typically describes the object's content or purpose and makes it easier to understand what the object represents (e.g. processed_20251214). Creating multiple representations is only relevant if it is considered necessary to preserve both an original primary representation and something derived from it. This may include an access copy, a processed, normalized, format-migrated, or repaired version of the primary representation. The purpose of the derivative, how it was created, and its relationship to the primary representation SHOULD be documented in PREMIS events, CS PREMIS (https://dilcis.eu/content-types/cits-premis). Certain types of events are recommended to be submitted via the Submission API. See Events/preservation metadata (https://digitalpreservation.no/docs/dps/api/submission/events/) for more information. We discourage preserving derivatives that can easily and automatically be reproduced from the primary representation. See the principle of sustainability in digital preservation (https://digitalpreservation.no/docs/principles/) for more information. This requirement is a stricter version of CSIPSTR10 (https://earkcsip.dilcis.eu/#CSIPSTR10). If the package contains multiple representations, they must follow the same structural format as 'primary_YYYYMMDD' (NBSIPSTR13-17 and CSIPSTR13).",
      "descriptionNorwegian":"Ved behov KAN mappa 'representations' inneholde flere representasjoner. Navngivning for representasjoner skal være meningsbærende navn og dato for når mappen ble opprettet (meningsbærende navn_ÅÅÅÅMMDD). Et meningsbærende navn beskriver typisk objektets innhold eller formål, og gjør det lettere å forstå hva objektet representerer (feks. prossesert_20251214). Opprettelse av flere representasjoner er kun relevant hvis det er ønskelig å bevare både en original primærrepresentasjon og noe som er utledet fra den. Dette kan være en tilgangskopi, prosessert, normalisert, formatmigrert eller reparert variant av primærrepresentasjonen. Formålet med derivatet, hvordan det er fremstilt, og hvilken relasjon det har til primærrepresentasjonen BØR dokumenteres i premis events, CS PREMIS (https://dilcis.eu/content-types/cits-premis). Enkelte typer eventer anbefales levert via Submission API. Se Eventer/bevaringsmetadata (https://digitalpreservation.no/nb/docs/dps/api/submission/events/) for mer informasjon. Vi fraråder å bevare derivater, som lett og maskinelt kan gjenskapes fra primærrepresentasjonen. Se prinsipp om bærekraft for digital bevaring (https://digitalpreservation.no/nb/docs/principles/) for mer informasjon. Dette er en strengere, SIP-spesifikk variant av CSIPSTR10 (https://earkcsip.dilcis.eu/#CSIPSTR10). Hvis pakken inneholder flere representasjoner, gjelder samme strukturkrav som for 'primary_ÅÅÅÅMMDD' (NBSIPSTR13-17 og CSIPSTR13).",
      "requirement": "MAY",
      "cardinality": "0..n",
      "path": "root_folder/representations/"
    },
    {
      "id": "NBSIPSTR13", 
      "descriptionEnglish": "Each representation folder MUST contain exactly one folder named 'data', which in turn MUST contain the data that constitutes the specific representation. This requirement is a stricter version of CSIPSTR11 (https://earkcsip.dilcis.eu/#CSIPSTR11). ",
      "descriptionNorwegian":"Hver representasjonsmappe MÅ inneholde nøyaktig én mappe som heter 'data', som igjen MÅ inneholde dataene som utgjør den spesifikke representasjonen. Dette er en strengere, SIP-spesifikk variant av CSIPSTR11 (https://earkcsip.dilcis.eu/#CSIPSTR11).",
      "requirement": "MUST",
      "cardinality": "1..1",
      "path": "root_folder/representations/primary_YYYYMMDD/data/"
    },
    {
      "id": "NBSIPSTR14",
      "descriptionEnglish": "Each representation folder MUST contain a metadata file named 'METS.xml', which includes information about the identity and structure of the representation and its components. 'METS.xml' MUST comply with the requirements specified in the METS.xml requirements (https://digitalpreservation.no/docs/dps/sip/1.0/mets/). This requirement is a stricter version of CSIPSTR12 (https://earkcsip.dilcis.eu/#CSIPSTR12).",
      "descriptionNorwegian":"Hver representasjonsmappe MÅ inneholde en metadatafil som heter 'METS.xml', som inneholder informasjon om identiteten og strukturen til representasjonen og dens komponenter. 'METS.xml' MÅ innfri kravene spesifisert i Krav til METS.xml (https://digitalpreservation.no/nb/docs/dps/sip/1.0/mets/). Dette er en strengere, SIP-spesifikk variant av CSIPSTR12 (https://earkcsip.dilcis.eu/#CSIPSTR12).",
      "requirement": "MUST",
      "cardinality": "1..1",
      "path": "root_folder/representations/primary_YYYYMMDD/METS.xml"
    },
    {
      "id": "CSIPSTR13",
      "descriptionEnglish": "(https://earkcsip.dilcis.eu/#CSIPSTR13). The representation folder SHOULD include a sub-folder named 'metadata', which MAY include metadata about the specific representation.",
      "descriptionNorwegian":"(https://earkcsip.dilcis.eu/#CSIPSTR13). Hver representasjonsmappe BØR inneholde en undermappe som heter 'metadata', som KAN inneholde metadata om den spesifikke representasjonen.",
      "requirement": "SHOULD",
      "cardinality": "0..1",
      "path": "root_folder/representations/primary_YYYYMMDD/metadata"
    },
    {
      "id": "NBSIPSTR15",
      "descriptionEnglish": "The subfolder named 'metadata' within the representation folder MAY contain a subfolder named 'preservation'. Preservation metadata specific to the representation can be placed here. The E-ARK specifications recommend formatting preservation metadata using PREMIS, see E-ARK CSIP - Common Specification for Information Packages (https://earkcsip.dilcis.eu/#useofpremis) and CS PREMIS (https://dilcis.eu/content-types/cits-premis). Certain types of events are recommended to be submitted via the Submission API. See Events/preservation metadata](https://digitalpreservation.no/docs/dps/api/submission/events/) for more information.",
      "descriptionNorwegian":"Undermappa 'metadata' i representasjonsmappa KAN inneholde en undermappe som heter 'preservation'. Her kan det legges bevaringsmetadata som gjelder den spesifikke representasjonen. E-ARK-spesifikasjonene anbefaler å formatere bevaringsmetadata i PREMIS, se E-ARK CSIP - Common Specification for Information Packages (https://earkcsip.dilcis.eu/#useofpremis) og CS PREMIS (https://dilcis.eu/content-types/cits-premis). Enkelte typer eventer anbefales levert via Submission API. Se Eventer/bevaringsmetadata (https://digitalpreservation.no/nb/docs/dps/api/submission/events/) for mer informasjon.",
      "requirement": "MAY",
      "cardinality": "0..1",
      "path": "root_folder/representations/primary_YYYYMMDD/metadata/preservation"
    },
    {
      "id": "NBSIPSTR16",
      "descriptionEnglish": "If technical metadata exists, it SHOULD be placed in the 'metadata' subfolder, in a folder named 'technical'. Technical metadata MUST be organized into subfolders named according to the type of technical information they contain. Technical metadata documents the technical characteristics of a digital file or resource, such as file format, resolution, compression type, dimensions, color depth, and software/hardware requirements for opening the file. Examples of such files include metadata files produced by MediaInfo, ExifTool, JHOVE, etc. These can be placed in separate subfolders (e.g., 'technical/mediainfo', 'technical/exiftool', 'technical/jhove', etc.). See also NBSIP16-23 in METS.xml (SIP) (https://digitalpreservation.no/docs/dps/sip/1.0/mets/). ",
      "descriptionNorwegian":"Hvis tekniske metadata finnes BØR disse legges i undermappa 'metadata', i en mappe som heter 'technical'. Tekniske metadata MÅ legges i undermapper navngitt etter typen teknisk informasjon det er snakk om. Tekniske metadata dokumenterer de tekniske egenskapene til en digital fil eller ressurs, slik som filformat, oppløsning, komprimeringstype, dimensjoner, fargedybde, og programvare-/ maskinvarekrav for å åpne filen. Eksempler på slike filer kan være metadatafiler produsert av Mediainfo, ExifTool, Jhove, etc, disse kan plasseres i egne undermapper ('technical/mediainfo', 'technical/exiftool', 'technical/jhove', etc). Se også NBSIP16-23 i METS.xml (SIP) (https://digitalpreservation.no/nb/docs/dps/sip/1.0/mets/).",
      "requirement": "SHOULD",
      "cardinality": "0..n",
      "path": "root_folder/representations/primary_YYYYMMDD/metadata/technical"
    },
    {
      "id": "NBSIPSTR17",
      "descriptionEnglish": "If the contents of the information package are derived from a source material through digitisation or similar processes, then metadata about the source object SHOULD be included in the package. For example, if an information package contains a digitised image, then any metadata about the original analogue image should also be provided. This information is placed in the representation folder, under the 'metadata' subfolder, in a folder named 'source'. This may include technical metadata describing the image (resolution, color, etc.) or identifiers, provenance, and other information related to the source. See also NBSIP7-15 in METS.xml (SIP) (https://digitalpreservation.no/docs/dps/sip/1.0/mets/).",
      "descriptionNorwegian":"Hvis innholdet i informasjonspakken er utledet fra et kildemateriale gjennom digitalisering eller lignende, BØR metadata om kildeobjektet legges med i pakka. For eksempel hvis en informasjonspakke inneholder et digitalisert bilde, burde eventuelle metadata om det originale analoge bildet legges ved. Denne informasjonen legges i representasjonsmappa, undermappa 'metadata', i en mappe som heter 'source'. Dette kan være tekniske metadata som beskriver bildet (oppløsning, farger mm), eller IDer, proveniens etc knyttet til kilden. Se også NBSIP7-15 i METS.xml (SIP) (https://digitalpreservation.no/nb/docs/dps/sip/1.0/mets/.",
      "requirement": "SHOULD",
      "cardinality": "0..1",
      "path": "root_folder/representations/primary_YYYYMMDD/metadata/source"
    },
    {
      "id": "NBSIPSTR18",
      "descriptionEnglish": "The Information Package MUST have one subfolder at the root level named 'schemas', which MUST contain all XML schema documents for all structured metadata in the package. Schemas MUST NOT be placed in the representation folders. This requirement is a stricter version of CSIPSTR15 (https://earkcsip.dilcis.eu/#CSIPSTR15).",
      "descriptionNorwegian":"En SIP MÅ ha én undermappe i rotmappa om heter 'schemas' som MÅ inneholde alle XML-skjemadokumenter for alle strukturerte metadata i pakken. Skjemaer SKAL IKKE legges i representasjonsmappene. Dette er en strengere, SIP-spesifikk variant av CSIPSTR15 (https://earkcsip.dilcis.eu/#CSIPSTR15).",
      "requirement": "MUST",
      "cardinality": "1..1",
      "path": "root_folder/schemas"
    },
    {
      "id": "NBSIPSTR19",
      "descriptionEnglish": "If there is additional documentation necessary to make use of the contents of a package, it is recommended to include it. Such additional documentation SHOULD be placed in a folder at the root level named 'documentation'. Examples of documentation include manuals for the system from which the data objects were exported, installation guides, and system usage requirements (hardware and software requirements). This additional documentation SHOULD be in a recommended file format (https://digitalpreservation.no/docs/formats/), such as plain text (UTF-8) (e.g., XML, JSON, TXT) or PDF/A. This requirement is a stricter version of CSIPSTR16 (https://earkcsip.dilcis.eu/#CSIPSTR16).",
      "descriptionNorwegian":"Hvis det finnes tilleggsdokumentasjon som er nødvendig for å nyttiggjøre seg av innholdet i en pakke, anbefales det å inkludere dette. Tilleggsdokumentasjon BØR plasseres i én mappe på rot som heter 'documentation'. Eksempler på dokumentasjon kan være manualer for systemet dataobjektene er eksportert fra, installasjonsveiledning og krav til bruk av system (maskin- og programvarekrav). Slik tilleggsdokumentasjon BØR være på et anbefalt filformat (https://digitalpreservation.no/nb/docs/formats/), slik som ren tekst (UTF-8) (f.eks. XML, JSON, TXT) eller PDF/A. Dette er en strengere, SIP-spesifikk variant av CSIPSTR16 (https://earkcsip.dilcis.eu/#CSIPSTR16).",
      "requirement": "SHOULD",
      "cardinality": "0..1",
      "path": "root_folder/documentation"
    },
    {
      "id": "NBSIPSTR20",
      "descriptionEnglish": "The Information Package MUST only contain folders that are explicitly permitted by the NBSIPSTR requirements. This requirement is a stricter version of CSIPSTR14 (https://earkcsip.dilcis.eu/#CSIPSTR14).",
      "descriptionNorwegian":"En SIP MÅ kun inneholde mapper som er eksplisitt tillatt av NBSIPSTR-krav. Dette er en strengere, SIP-spesifikk variant av CSIPSTR14 (https://earkcsip.dilcis.eu/#CSIPSTR14).",
      "requirement": "MUST",
      "cardinality": "1..1"
    }
  ]
}
