{
  "profile": {
    "name": "NB-METS-IMAGES-1.0",
    "description": "Requirements for METS.xml for submission of ContentType IMAGES to the National Library of Norway"
  },
  "requirements": [
    {
      "id": "NBIMAGESIP1",
      "name": "Content Category",
      "description_english": "The mets/@TYPE attribute MUST be used to specify the content category of the package, e.g., 'Datasets', 'Websites', 'Mixes', 'Other', etc. Valid values are defined in a controlled vocabulary. The vocabulary will be updated by the DILCIS Board as new content information specifications are added. For images, the following values are used: Photographs - Print: Used for a digitized version of a physical photograph. Photographs - Digital: Used for a born-digital photograph. Other Graphic Images - Print: Used for digitized versions of posters, drawings, postcards, maps, etc. Other Graphic Images - Digital: Used for digital posters, drawings, postcards, maps, etc. See the vocabulary E-ARK-CSIP-Content Category (https://github.com/DILCISBoard/E-ARK-CSIP/blob/master/schema/CSIPVocabularyContentCategory.xml). This is a specification of CSIP2 (https://earkcsip.dilcis.eu/#CSIP2).",
      "description_norwegian": "Attributtet mets/@TYPE MÅ brukes til å angi kategorien til innholdet i pakken, f.eks. 'Datasets', 'Websites', 'Mixes', 'Other', etc. Gyldige verdier er definert i et fastsatt vokabular. Vokabularet vil oppdateres av DILCIS-styret etter hvert som tilleggsspesifikasjoner for innholdsinformasjon legges til. For bilder brukes disse: Photographs - Print: Brukes for en digitalisert versjon av et fysisk fotografi. Photographs - Digital: Brukes for et digitalt fotografi. Other Graphic Images - Print: Brukes for en digitalisert versjon av fysiske plakater, tegninger, postkort, kart, etc. Other Graphic Images - Digital: Brukes for digitale plakater, tegninger, postkort, kart, etc. Se vokabular E-ARK-CSIP-Content Category (https://github.com/DILCISBoard/E-ARK-CSIP/blob/master/schema/CSIPVocabularyContentCategory.xml). Dette er en spesifisering av CSIP2 (https://earkcsip.dilcis.eu/#CSIP2).",
      "requirement": "MUST",
      "cardinality": "1..1",
      "path": "mets/@TYPE"
    },
    {
      "id": "NBIMAGESIP2",
      "name": "Content Information Type Specification",
      "description_english": "Used to define the type specification of content information applied when the package was created. Valid values are defined in a controlled vocabulary. The attribute is mandatory for METS documents at the representation level. The vocabulary will be updated by the DILCIS Board as new content information specifications are added. For images, the value OTHER is used (indicating a value not currently covered by the vocabulary). See the vocabulary E-ARK-CSIP-Content Information Type (https://github.com/DILCISBoard/E-ARK-CSIP/blob/master/schema/CSIPVocabularyContentInformationType.xml). This is a specification of CSIP4 (https://earkcsip.dilcis.eu/#CSIP4).",
      "description_norwegian": "Brukes til å definere spesifikasjoner for type innholdsinformasjon som ble brukt når pakken ble opprettet. Gyldige verdier er definert i et fastsatt vokabular. Attributten er obligatorisk for METS-dokumenter på representasjonsnivå. Vokabularet vil oppdateres av DILCIS-styret etter hvert som tilleggsspesifikasjoner for innholdsinformasjon legges til. For bilder brukes OTHER (en annen term enn det som finnes i det brukte vokabularet). Se vokabular E-ARK-CSIP-Content Information Type (https://github.com/DILCISBoard/E-ARK-CSIP/blob/master/schema/CSIPVocabularyContentInformationType.xml). Dette er en spesifisering av CSIP4 (https://earkcsip.dilcis.eu/#CSIP4).",
      "requirement": "MUST",
      "cardinality": "1..1",
      "path": "mets/@csip:CONTENTINFORMATIONTYPE"
    },
    {
      "id": "NBIMAGESIP3",
      "name": "Other Content Information Type Specification",
      "description_english": "When the value of mets/@csip:CONTENTINFORMATIONTYPE is OTHER, the mets/@csip:OTHERCONTENTINFORMATIONTYPE MUST specify the type of content information. For images the value of OTHERCONTENTINFORMATIONTYPE MUST be: NB-SIP-IMAGES-PROFILE-1.0. This is a specification of CSIP5 (https://earkcsip.dilcis.eu/#CSIP5).",
      "description_norwegian": "Når mets/@csip:CONTENTINFORMATIONTYPE har verdien OTHER, MÅ mets/@csip:OTHERCONTENTINFORMATIONTYPE oppgi type innholdsinformasjon. OTHERCONTENTINFORMATIONTYPE for bilder MÅ være NB-SIP-IMAGES-PROFILE-1.0. Dette er en spesifisering av CSIP5 (https://earkcsip.dilcis.eu/#CSIP5).",
      "requirement": "MUST",
      "cardinality": "1..1",
      "path": "mets[@csip:CONTENTINFORMATIONTYPE='OTHER']/@csip:OTHERCONTENTINFORMATIONTYPE"
    }
  ]
}
